# LevelOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GenericZone..::..LevelOffset Property
GenericZone Class See Also
---
The offset distance from this zone to the associated level.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double LevelOffset { get; set; }
```

Visual Basic
---
```text
Public Property LevelOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double LevelOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for offset must be no more than 30000 feet in absolute value. |

# See Also
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace